import * as React from 'react';
import Container from '@mui/material/Container';
import Box from '@mui/material/Box';
export default function About() {
return (<div style={{textAlign:'center',marginTop:'7vh'}}>
  <Box sx={{ flexGrow: 1 }}>
  

  <Container component="main" maxWidth="lg">
 
  <Box>
<div style={{color:'#8e24aa',fontSize:'4vh'}}>מדריך למשתמש</div>
<div style={{fontSize:'2.8vh',lineHeight:'1.9',marginTop:'2vh',textAlign:'justify',direction:'rtl'}}>


בעת כניסתך לאתר הנך נמצא בדף הבית הנך נדרש להכניס סיסמא. באם הנך משתמש רשום במערכת כלומר הנך עובד רשום עומדות בפניך האפשרויות הבאות:

צפיה במשמרות יום נוכחי שלך- הנך יכול לצפות במשמרות יום נוכחי שלך וכן לבחור משמרת מסוימת ולצפות בפרטי המסלול של משמרת זו, שכוללים תחנות שבהם אתה אמור לעלות לקווים ומפה של המסלול שבו עליך לנסוע כולל מיקום של התחנות בהן תעבור.

באם הנך מנהל המערכת ניצבות בפניך האפשרויות הבאות:

הוספת פקח- בלחיצה על אפשרות זו יהיה עליך להכניס את פרטי הפקח וכן פרטי משמרת של פקח ולאשר את ההוספה.

מחיקת פקח- בלחיצה על אפשרות זו תוכל למחוק פקח לפי הסיסמא שלו.  

צפיה בפרטי משמרות של יום נוכחי- בלחיצה על אפשרות זו תוכל לצפות בפרטים אודות המשמרות של יום זה של כל הפקחים הקיימים במערכת,  ובלחיצה על משמרת תוכל לצפות בפרטי מסלול העבודה של משמרת זו כולל מפה עם המסלול.

צפיה בפקחים-צפיה בפרטי כל הפקחים הקיימים במערכת. לכל שורה בטבלה יש כפתור לצפיה במשמרות- בלחיצה על אפשרות זו תוכל לצפות במשמרות של הפקח. וכן עומדות בפניך כמה אפשרויות :

מחיקת משמרת- בלחיצה על אפשרות זו תמחק משמרת זו מן המערכת.

עדכון משמרת- בלחיצה על אפשרות זו תוכל לשנות פרטי משמרת.
</div>   </Box>
    </Container>

</Box>  
</div>)
}